[
  {
    "name": "Atuhaire Edgar, (BAEd-MUK, MPHL-UCU, PhD. Cand. UG (WHO-HRP) Research Fellow",
    "title": "Founder and Executive Director",
    "photo": "/crid/Atuhaire.png",
    "bio": "Atuhaire Edgar is a distinguished Public Health and Program Management Specialist with over 16 years of leadership experience in health systems strengthening, institutional development, and program implementation across East Africa. He is the Founder and Executive Director of CRID International, a development organisation committed to promoting health equity, institutional capacity building, and community resilience through research, innovation, and development practice. Edgar is a PhD Candidate and WHO/HRP Research Fellow in Public Health at the University of Ghana, specialising in Population, Family, and Reproductive Health. His doctoral research focuses on the impact of peer support interventions on stigma reduction and viral load suppression among adolescents living with HIV in Northern Uganda. He holds a Master of Public Health Leadership from Uganda Christian University and a Bachelor's in Education from Makerere University. A passionate educator, he lectures at Uganda Christian University and Victoria University, teaching courses in Health Policy, Health Systems, and Sexual and Reproductive Health. Edgar's professional journey spans work with the Ministry of Health–Uganda, Society for Family Health (Rwanda), and several international organisations, where he has led large-scale public health and education programs in HIV prevention, adolescent health, and maternal and child health. His expertise includes strategic program management, policy development, capacity building, and institutional reform. Edgar is committed to strengthening African institutions to deliver sustainable, people-centred health outcomes. His work reflects a deep belief in community-led development, evidence-based decision-making, and integrated health systems that advance equity, resilience, and transformative change.",
    "links": [
      {"type":"email","href":"mailto:edgatuhaire@gmail.com"},
      {"type":"tel","href":"tel:+256772699471"}
    ]
  },
  {
    "name": "NYAGATARE Jean De Dieu",
    "title": "Director, IT Solutions and Innovations",
    "photo": "/crid/Jean.png",
    "bio": "NYAGATARE Jean De Dieu is an experienced IT professional and Director specializing in IT Solutions and Innovations at CRID International. With expertise in technology-driven solutions, digital transformation, and innovation management, Jean De Dieu leads the organization's technology initiatives and digital strategy. His work focuses on leveraging cutting-edge IT solutions to enhance organizational efficiency, drive innovation, and support CRID's mission of advancing research, capacity building, and sustainable development across Africa. Jean De Dieu is committed to harnessing the power of technology to create scalable, impactful solutions that address real-world challenges in health, education, and institutional development.",
    "links": [
      {"type":"email","href":"mailto:nyagatare10@gmail.com"},
      {"type":"tel","href":"tel:+256749277259"},
      {"type":"external","label":"LinkedIn","href":"https://www.linkedin.com/in/nyagatare-jean-de-dieu-0696a1203/"}
    ]
  },
  {
    "name": "Humphrey Atwijukiire, BNS, MHSR",
    "title": "Training and Grants Manager",
    "photo": "/crid/Akatwijuka.png",
    "bio": "Health services researcher with expertise in health systems, mental health, climate & health, infectious disease, and digital health. Skilled in Stata, SPSS, NVivo, Atlas.ti, and R. Has contributed to malaria elimination, HIV care, climate resilience, and AI-in-health projects; authored peer-reviewed publications and secured multiple competitive research grants and fellowships.",
    "links": [
      {"type":"email","href":"mailto:htwijukiire@gmail.com"},
      {"type":"tel","href":"tel:+256775131535"},
      {"type":"external","label":"ResearchGate","href":"#"}
    ]
  },
  {
    "name": "Dr. Felix Bongomin, MBChB, MSc, MMed, FECMM",
    "title": "Director of Research & Programs",
    "photo": "/crid/Dr.png",
    "bio": "Dr Bongomin is an Infectious Diseases Physician and Lecturer in Medical Microbiology and Internal Medicine at Gulu University School of Medicine, Uganda. He holds an MBChB, an M.Med in Internal Medicine, and MSc Medical Microbiology. Dr. Bongomin has extensive experience in clinical research, medical education, and implementation science in resource-limited settings. He has authored over 300 peer-reviewed publications and book chapters, with his work cited more than 9,500 times worldwide. His research focuses on infectious diseases epidemiology, fungal infections, antimicrobial resistance, and health systems strengthening. Dr. Bongomin previously served on the Gulu University Research Ethics Committee and has been instrumental in promoting community-based research and the ethical conduct of studies involving vulnerable populations. He has led several studies in Uganda and the UK. In his current role as Director for Research and Programs at the Centre for Research Innovations and Development (CRID), Dr. Bongomin provides strategic leadership in research design, ethics oversight, program implementation, and capacity development. His professional interests include community engagement in health research, research ethics, and the mentorship of early-career investigators to strengthen Africa's health research and innovation ecosystem.",
    "links": [
      {"type":"email","href":"mailto:drbongomin@gmail.com"},
      {"type":"tel","href":"tel:+256784523395"}
    ]
  },
  {
    "name": "Dr. Samuel Tumwesigye (PhD)",
    "title": "Technical Advisor: Agriculture, Climate Adaptation, and Rural Development",
    "photo": "/crid/Samuel.png",
    "bio": "Dr. Samuel Tumwesigye has over fifteen years of experience in agriculture, climate adaptation and rural development. In his career practice, working as a Program Officer, Technical Specialist and Senior Specialist at UNDP FAO, GCA, IFAD and BATU, in Africa and Asia, Samuel programed and implemented climate resilient agriculture development programs and also supported policy formulation. His roles included climate adaptation planning and programming for transformative systems change—covering natural and agri-food systems—aimed at scaling climate adaptation and mobilizing impactful climate investments. He has extensively led sectoral and landscape assessments, generating evidence base to drive informed policies, climate adaptation planning, finance mobilization and partnerships building for a resilient Agriculture Sector. He holds a Doctor of Science from KU Leuven, Belgium, Master of Science in Rural Development from Ghent University, and Bachelor of Science in Agriculture, from Makerere University Kampala, Uganda. His doctoral research focused on spatial analysis and scenario modelling of rural-urban interaction, and climate change impacts and land use change. Samuel's career drive is to leverage his expertise and contribute to building climate-resilient agriculture and rural development, while enhancing food security and poverty and rural livelihoods in the Global South. In his free time, Samuel enjoys reading, cycling through nature paths, watching football and playing games with his twins.",
    "links": [
      {"type":"email","href":"mailto:Sammykahembo@gmail.com"},
      {"type":"tel","href":"tel:+256755703098"}
    ]
  },
  {
    "name": "Dr. Pontian Kabeera (PhD)",
    "title": "Technical Advisor: Inclusive, Competence-based and Special Education",
    "photo": "/crid/Kabera.png",
    "bio": "Dr. Pontian Kabeera is an experienced education specialist and Technical Advisor focusing on Inclusive, Competence-based and Special Education at CRID International. With extensive expertise in educational policy, curriculum development, and inclusive pedagogies, Dr. Kabeera provides strategic guidance on transforming education systems to ensure equitable access and quality learning for all learners, including those with special educational needs. His work emphasizes competence-based approaches that prepare learners with practical skills for the modern workforce, while promoting inclusive practices that leave no one behind. Dr. Kabeera is committed to advancing education equity, strengthening teacher capacity, and building resilient, learner-centered education systems across Africa.",
    "links": [
      {"type":"email","href":"mailto:pontiankbr@gmail.com"},
      {"type":"tel","href":"tel:+256775752596"}
    ]
  }
]

