[
  {
    "name": "Atuhaire Edgar",
    "title": "Executive Director",
    "photo": "/crid/Atuhaire.png",
    "bio": "Public Health Specialist & Educator with 16+ years of experience in health systems strengthening, institutional development, and program implementation across East Africa. WHO/HRP Research Fellow and PhD Candidate (University of Ghana) specializing in Population, Family, and Reproductive Health. Leads CRID in research, gender & development, institutional capacity building, and youth empowerment; contributor to national strategies, training manuals, and policy reforms.",
    "links": []
  },
  {
    "name": "Humphrey Atwijukiire, BNS, MHSR",
    "title": "Research Fellow | Health Services Researcher | Public Health Scientist",
    "photo": "/crid/Akatwijuka.jpg",
    "bio": "Health services researcher with expertise in health systems, mental health, climate & health, infectious disease, and digital health. Skilled in Stata, SPSS, NVivo, Atlas.ti, and R. Has contributed to malaria elimination, HIV care, climate resilience, and AI-in-health projects; authored peer-reviewed publications and secured multiple competitive research grants and fellowships.",
    "links": [
      {"type":"email","href":"mailto:htwijukiire@gmail.com"},
      {"type":"tel","href":"tel:+256775131535"},
      {"type":"external","label":"ResearchGate","href":"#"}
    ]
  },
  {
    "name": "Dr. Felix Bongomin, MBChB, MSc, MMed, FECMM",
    "title": "Director of Research & Programs",
    "photo": "/crid/Dr.png",
    "bio": "Dr Bongomin is an Infectious Diseases Physician and Lecturer in Medical Microbiology and Internal Medicine at Gulu University School of Medicine, Uganda. He holds an MBChB, an M.Med in Internal Medicine, and MSc Medical Microbiology. Dr. Bongomin has extensive experience in clinical research, medical education, and implementation science in resource-limited settings. He has authored over 300 peer-reviewed publications and book chapters, with his work cited more than 9,500 times worldwide. His research focuses on infectious diseases epidemiology, fungal infections, antimicrobial resistance, and health systems strengthening. Dr. Bongomin previously served on the Gulu University Research Ethics Committee and has been instrumental in promoting community-based research and the ethical conduct of studies involving vulnerable populations. He has led several studies in Uganda and the UK. In his current role as Director for Research and Programs at the Centre for Research Innovations and Development (CRID), Dr. Bongomin provides strategic leadership in research design, ethics oversight, program implementation, and capacity development. His professional interests include community engagement in health research, research ethics, and the mentorship of early-career investigators to strengthen Africa's health research and innovation ecosystem.",
    "links": []
  }
]

